[
  {
    "text": "Skriv in din personliga kod:",
    "answer_type": "text_input"
  },
  {
    "text": "Vilken är din ålder?",
    "answer_type": "number_input"
  },
  {
    "text": "Vilket kön tillhör du?",
    "answer_type": "alternatives",
    "alternatives": [
      "Kvinna",
      "Man",
      "Annat/inget",
      "Vill ej uppge"
    ]
  },
  {
    "text": "Vilken är din hudtyp? Ange vilket av följande påståenden som bäst stämmer överens med hur din hud reagerar när du vistats i solen:",
    "answer_type": "alternatives",
    "alternatives": [
      "Jag har lätt för att bli röd, men blir sällan eller aldrig brun.",
      "Jag har lätt för att bli röd, men jag kan ibland också bli lite brun.",
      "Det kan ibland hända att jag blir röd, men jag blir alltid brun.",
      "Jag blir aldrig röd, men har lätt för att bli brun.",
      "Min hud är en aning brun för jämnan, och när jag är i solen blir jag mörkare brun men aldrig röd.",
      "Min hud är för jämnan väldigt mörkt brun eller svart."

    ]
  },
  {
    "text": "Vilken är din naturliga hårfärg? Ange den som ligger närmast av nedanstående:",
    "answer_type": "alternatives",
    "alternatives": [
      "Svart",
      "Brun",
      "Blond",
      "Röd"
    ]
  },
  {
    "text": "Har du fräknar?",
    "answer_type": "alternatives",
    "alternatives": [
      "Nej",
      "Ja"
    ]
  },
  {
    "text": "Har du själv haft någon form av hudcancer?",
    "answer_type": "alternatives",
    "alternatives": [
      "Nej",
      "Ja, malignt melanom",
      "Ja, men inte malignt melanom (basaliom/basalcellscancer eller skivepitelcancer)",
      "Ja, men vet inte vilken sort",
      "Osäker/Vet inte"
    ]
  },
  {
    "text": "Har någon/några av dina biologiska föräldrar eller syskon drabbats av malignt melanom?",
    "answer_type": "alternatives",
    "alternatives": [
      "Nej",
      "Ja, en förälder eller ett syskon",
      "Ja, antingen båda föräldrarna, en förälder och minst ett syskon, eller fler än ett syskon",
      "Osäker/Vet ej"
    ]
  },
  {
    "text": "Titta efter på dina båda underarmar och räkna hur många leverfläckar (oavsett storlek) du har på dem tillsammans",
    "answer_type": "number_input"
  },
  {
    "text": "Om du tänker på hur du ser ut på hela kroppen, har du fler än två leverfläckar som är större än 5 mm?",
    "answer_type": "alternatives",
    "alternatives": [
      "Nej, jag har inga eller färre än tre leverfläckar som är större än 5 mm",
      "Ja, jag har minst tre leverfläckar som är större än 5 mm"
    ]
  }
]